In [197]:
import pandas as pd
pd.options.mode.chained_assignment = None
df=pd.read_csv(r'C:\Users\Я\Desktop\читы жизнь\Study\Programming\0_Jupyter\students.csv',delimiter=',')

In [198]:
df_cut=df[['Age','Growth','Weight']]
df_cut['Mass index']=df_cut['Weight']/((df_cut['Growth']/100)**2)

Коэффициент корреляции расчитывается по команде: .corr()
Пример:
df_cut.corr()

In [199]:
df_cut.corr()

                 Age    Growth    Weight  Mass index
Age         1.000000 -0.101982 -0.185722   -0.200305
Growth     -0.101982  1.000000  0.544528    0.146201
Weight     -0.185722  0.544528  1.000000    0.904678
Mass index -0.200305  0.146201  0.904678    1.000000

In [200]:
df.groupby(['Sex'])[['Growth','Weight']].std()

           Growth     Weight
Sex
женский  5.701190  13.642451
мужской  6.864931  17.717777

In [201]:
df.groupby(['Sex'])[['Growth','Weight']].std()

           Growth     Weight
Sex
женский  5.701190  13.642451
мужской  6.864931  17.717777

In [202]:
df.groupby(['Chocolate'])[['Russian rating','Maths rating']].mean()

                                   Russian rating  Maths rating
Chocolate
M&Ms                                    81.000000     61.000000
Баунти                                  80.433333     59.433333
КитКат                                  81.885714     58.114286
Марс                                    88.636364     45.181818
Милки Вей                               77.588235     50.117647
Натс                                    82.461538     56.615385
Скиттлс (хотя это и не шоколадка)       85.000000     72.000000
Сникерс                                 78.941176     60.235294
Твикс                                   84.323529     61.617647

In [203]:
df_Exams=df[['Maths rating','Russian rating']].copy()

In [204]:
df_Exams[(df_Exams['Russian rating']>=50)&(df['Russian rating']<=70)].count()

Maths rating      24
Russian rating    24
dtype: int64

# Задание 1
### Из имеющейся таблицы с анкетами наших студентов создайте "обрезанную таблицу" df_cut, состоящую из столбцов "Год рождения", "Рост", "Вес", "Длина волос", "Размер обуви".

### Отсортируйте таблицу по возрастанию признака "Размер обуви". В ответ напишите год рождения студента, попавшего в первую строку отсортированной таблицы.

### П.С. Вы тоже офигеваете, когда оказывается, что люди, родившиеся в 21-м веке, уже учатся в универе?

In [205]:
df_cut_new=df[['Year of birth','Growth','Weight','Hair length','Shoe size']]
df_cut_new.sort_values(['Shoe size','Growth'],ascending=[False,True]).head()

     Year of birth  Growth  Weight  Hair length  Shoe size
7             2003     180   120.0         20.0         48
27            2003     193    61.0          3.0         48
8             2002     185    69.0         25.0         46
103           2002     197   100.0         23.0         46
55            1999     180    92.0          0.2         45

In [223]:
df_cut = df[['Year of birth', 'Growth', 'Weight', 'Hair length', 'Shoe size']]
df_cut.sort_values(['Shoe size', 'Growth'], ascending=[False,True]).iloc[1]

Year of birth    2003.0
Growth            193.0
Weight             61.0
Hair length         3.0
Shoe size          48.0
Name: 27, dtype: float64

In [225]:
# Выведите на экран таблицу со значениями коэффициента корреляции (КК). 

# Чему равен КК для признаков "Рост" и "Размер обуви"? Ответ округлить до двух знаков после запятой
df_cut.corr()

               Year of birth    Growth    Weight  Hair length  Shoe size
Year of birth       1.000000 -0.113357  0.006042     0.095402  -0.108360
Growth             -0.113357  1.000000  0.544528    -0.554408   0.863252
Weight              0.006042  0.544528  1.000000    -0.319416   0.591149
Hair length         0.095402 -0.554408 -0.319416     1.000000  -0.567568
Shoe size          -0.108360  0.863252  0.591149    -0.567568   1.000000

In [207]:
max_full_length=df['Growth'].max()+df['Hair length'].max()
print(max_full_length)

347.0

In [208]:
new_max_full_length_df=df[df['Growth']==df['Growth'].max()]

In [209]:
max_Growth = df['Growth'].max()
hair_who_max_Growth=new_max_full_length_df['Hair length'].iloc[0]
new_max_full_length=hair_who_max_Growth+max_Growth
print(max_Growth)
print(hair_who_max_Growth)
print(new_max_full_length)

197
23.0
220.0

In [210]:
max_hair_length=df[df['Hair length']==df['Hair length'].max()]
max_hair_length[['Growth','Hair length']]

     Growth  Hair length
184     169        150.0

In [211]:
max_hair_length['Growth'].iloc[0]+max_hair_length['Hair length'].iloc[0]

319.0

In [212]:
ThreeColumns=df[['Growth','Hair length']]

In [219]:
ThreeColumns['Full length']=ThreeColumns['Growth']+ThreeColumns['Hair length']

In [222]:
ThreeColumns['Full length'].

0      220.0
1      198.0
2      176.0
3      188.0
4      214.0
       ...
181    198.0
182    214.0
183    201.0
184    319.0
185    224.0
Name: Full length, Length: 186, dtype: float64

In [228]:
# С помощью метода-молитвы groupby сделайте так, чтобы на экран вывелась табличка (числа в ней - это средние баллы за ЕГЭ)

# Чему равно заштрихованное число? Округлить до одного знака после запятой.

Glas_Rus_Math=df.groupby(['Glasses'])[['Russian rating','Maths rating']].mean()
Glas_Rus_Math

                                     Russian rating  Maths rating
Glasses
да                                        83.388235     56.741176
нет                                       80.471910     59.955056
простите. не увидел(а) вопроса ))))       77.900000     54.700000

In [229]:
# С помощью метода groupby выведите на экран табличку (числа в ней - это средние баллы за ЕГЭ):
s
# Чему равно заштрихованное число? Ответ округлить до двух знаков после запятой.
RPS_Rus_Math=df.groupby(['Rock paper scissors'])[['Russian rating','Maths rating']].mean()
RPS_Rus_Math

                     Russian rating  Maths rating
Rock paper scissors
Бумага                    76.473684     52.894737
Камень                    81.450000     62.166667
Ножницы                   83.988636     57.738636